package school.redrover.HW2;
/*
Задача №3
Вывести/напечатать смайлик (не :), а настоящий смайлик одним символом).
from 07
 */
public class HW2_3 {
    public static void main(String[] args) {
        System.out.println("\u0044");
        System.out.println("smile, you are on camera: \uD83D\uDE01!");
    }
}
